Repository: codacy-open-source-projects-scans/sudo
Catalog: po/*.po
Languages: fa

source: unable to open userdb
fa: ناتوان در گشودن پایگاه دادهٔ کاربر

source: unable to switch to registry "%s" for %s
fa: ناتوان در تعویض به رجیستری «%s» برای %s

source: unable to restore registry
fa: ناتوان در بازگردانی رجیستری

source: unable to allocate memory
fa: ناتوان در تخصیص حافظه

source: %.*s exists but is not a directory (0%o)
fa: پروندهٔ %.*s وجود دارد ولی یک شاخه نیست (0%o)

source: unable to open %s
fa: ناتوان در گشودن %s

source: unable to mkdir %.*s
fa: ناتوان در ایجاد شاخهٔ %.*s

source: unable to open %.*s
fa: ناتوان در گشودن %.*s

source: regular expression too large
fa: عبارت باقاعده بیش از حد بلند است

source: Unknown signal
fa: علامت ناشناخته

source: invalid value
fa: مقدار نامعتبر

source: value too large
fa: مقدار بیش از حد بزرگ

source: value too small
fa: مقدار بیش از حد کوچک

source: invalid Path value "%s" in %s, line %u
fa: مقدار مسیر نامعتبر «%s» در %s، خط %u

source: invalid value for %s "%s" in %s, line %u
fa: مقدار نامعتبر برای %s «%s» در %s، خط %u

source: unsupported group source "%s" in %s, line %u
fa: گروه منبع پشتیبانی نشدهٔ «%s» در %s، خط %u

source: invalid max groups "%s" in %s, line %u
fa: بیشینهٔ گروه‌های نامعتبر «%s» در %s، خط %u

source: %s is not a regular file
fa: پروندهٔ %s معمولی نیست

source: %s is world writable
fa: مورد %s توسط همه قابل نوشتن است

source: %s is group writable
fa: مورد %s توسط گروه قابل نوشتن است

source: unable to change AppArmor profile to %s
fa: ناتوان در تغییر نماگر اپ‌آرمور به %s

source: %s: truncate %s to zero bytes? (y/n) [n]
fa: %s: پروندهٔ ⁨%s⁩ به صفر بایت کوتاه شود؟ (y/n) [n]

source: not overwriting %s
fa: پروندهٔ ⁨%s⁩ بازنویسی نشد

source: unable to read from %s
fa: ناتوان در خواندن از %s

source: unable to write to %s
fa: ناتوان در نوشتن روی %s

source: %s: not a regular file
fa: %s: یک پرونده معمولی نیست

source: %s: bad file mode: 0%o
fa: %s: حالت پرونده بد: ⁦0%o⁩

source: unable to restore current working directory
fa: ناتوان در بازگردانی شاخهٔ کاری کنونی

source: unable to set privileges
fa: ناتوان در تنظیم اجازه‌ها

source: unable to set limit privileges
fa: ناتوان در تنظیم اجازه‌های کران

source: unknown login class %s
fa: کلاس ورود ناشناختهٔ %s

source: unable to set user context
fa: ناتوان در تنظیم بافتار کاربر

source: unable to change root to %s
fa: ناتوان در تغییر ریشه به %s

source: unable to change directory to %s
fa: ناتوان در تغییر شاخه به %s

source: starting from %s
fa: شروع از %s

source: unable to set handler for signal %d
fa: ناتوان در تنظیم مدیریت کننده برای علامت %Id

source: unable to add event to queue
fa: ناتوان در افزودن رویداد به صف

source: command not set by the security policy
fa: دستور به دست سیاست امنیتی تنظیم نشده

source: command rejected by policy
fa: دستور به دست سیاست امنیتی رد شد

source: policy plugin error
fa: خطای افزایهٔ سیاست

source: client request too large: %zu
fa: درخواست کارخواه بسیار بیش از حد بزرگ: %zu

source: unable to unpack %s size %zu
fa: ناتوان در بسته‌گشایی %s به اندازهٔ %zu

source: server message too large: %zu
fa: پیام کارساز بسیار بزرگ: %zu

source: I/O plugin error
fa: خطای افزایهٔ ورودی/خروجی

source: command rejected by I/O plugin
fa: دستور توسط افزایهٔ ورودی/خروجی رد شد

source: error changing window size
fa: هنگام تغییر اندازهٔ پنجره خطایی رخ داد

source: unable to create sockets
fa: ناتوان در ایجاد سوکت‌ها

source: unable to receive message from parent
fa: ناتوان در گرفتن پیام را از والد

source: unable to fork
fa: ناتوان در انشعاب

source: unable to execute %s
fa: ناتوان در اجرای %s

source: unable to create pipe
fa: ناتوان در ایجاد لوله

source: error in event loop
fa: خطا در حلقهٔ رویداد

source: unable to set registers for process %d
fa: ناتوان در تنظیم رجیستری برای فرایند %Id

source: process %d exited unexpectedly
fa: فرایند %Id به طور غیرمنتظره‌ای خارج شد

source: unable to set seccomp filter
fa: ناتوان در تنظیم پالایهٔ محاسبات ایمن «seccomp»

source: %s[%d] mismatch, expected "%s", got "%s"
fa: ناهاهنگی %s‏[%Id]. انتظار «%s» می‌رفت. «%s» گرفته شد

source: unable to get event message for process %d
fa: ناتوان در گرفتن پیام رویداد برای فرایند %Id

source: unable to get registers for process %d
fa: ناتوان در گرفتن ثبّات‌ها برای فرایند %Id

source: unable to restore terminal settings
fa: ناتوان در بازگردانی تنظیمات پایانه

source: unable to set handler for SIGCONT
fa: ناتوان در تنظیم مدیریت کننده برای SIGCONT

source: unable to set handler for SIG%s
fa: ناتوان در تنظیم مدیریت کننده برای SIG%s

source: unable to restore handler for SIG%s
fa: ناتوان در بازگردانی مدیریت کننده برای SIG%s

source: unable to restore handler for SIGCONT
fa: ناتوان در بازگردانی مدیریت کننده برای SIGCONT

source: error in %s, line %d while loading plugin "%s"
fa: خطا در %s خط %Id هنگام بار کردن افزایهٔ «%s»

source: ignoring duplicate plugin "%s" in %s, line %d
fa: چشم‌پوشیدن از افزایهٔ تکراری «%s» در %s، خط %Id

source: unable to load %s: %s
fa: ناتوان در بار کردن %s:‏ %s

source: unable to find symbol "%s" in %s
fa: ناتوان در یافت نماد «%s» در %s

source: incompatible plugin major version %d (expected %d) found in %s
fa: نگارش اصلی افزایه %Id ناسازگار (انتظار %Id می‌رفت) در %s پیدا شد

source: ignoring policy plugin "%s" in %s, line %d
fa: چشم‌پوشیدن از افزایهٔ سیاست «%s» در %s، خط %Id

source: unknown plugin type %d found in %s
fa: گونهٔ افزایهٔ ناشناختهٔ %Id در %s یافت شد

source: invalid environment variable name: %s
fa: نام متغیر محیطی نامعتبر: %s

source: the argument to -C must be a number greater than or equal to 3
fa: آرگومان ‎-C باید عددی بزرگ‌تر یا مساوی ۳ باشد

source: you may not specify both the -i and -s options
fa: نباید هر دو گزینهٔ ‎-i و ‎-s را مشخّص کنید

source: you may not specify both the -i and -E options
fa: نباید هر دو گزینهٔ ‎-i و ‎-E را مشخّص کنید

source: the -E option is not valid in edit mode
fa: گزینهٔ ‎-E در حالت ویرایش معتبر نیست

source: you may not specify environment variables in edit mode
fa: در حالت ویرایش نباید متغیّرهای محیطی مشخّص کنید

source: the -U option may only be used with the -l option
fa: گزینهٔ ‎-U باید فقط همراه گزینهٔ ‎-l استفاده شود

source: the -A and -S options may not be used together
fa: گزینه‌های ‎-A و ‎-S نباید با یکدیگر استفاده شوند

source: sudoedit is not supported on this platform
fa: روی این بن‌سازه sudoedit پشتیبانی نمی‌شود

source: Only one of the -e, -h, -i, -K, -l, -s, -v or -V options may be specified
fa: فقط یکی از گزینه‌های ‎-e, -h, -i, -K, -l, -s, -v یا ‎-V باید مشخّص شود

source: Only one of the -K, -k or -N options may be specified
fa: فقط باید یکی از گزینه‌های -K،‏ ‪-k‬ یا ‪-N‬ مشخّص شود

source: %s - edit files as another user
fa: %s - ویرایش پرونده‌ها به عنوان کاربری دیگر

source: %s - execute a command as another user
fa: %s - اجرای دستور به عنوان کاربری دیگر

source: Options:
fa: گزینه‌ها:

source: use a helper program for password prompting
fa: استفاده از برنامه‌ای کمکی برای اعلان دهی گذرواژه

source: use specified BSD authentication type
fa: استفاده از گونهٔ هویت‌سنجی BSD مشخّص شده

source: run command in the background
fa: اجرای دستور در پس‌زمینه

source: ring bell when prompting
fa: زدن زنگ هنگام اعلان دهی

source: close all file descriptors >= num
fa: بستن همهٔ توصیف‌گرهای پروندهٔ بزرگ‌تر از num

source: run command with the specified BSD login class
fa: اجرا دستور با کلاس ورود BSD مشخّص شده

source: change the working directory before running command
fa: تغییر شاخهٔ کاری پیش از اجرای دستور

source: preserve user environment when running command
fa: حفظ محیط کاربر هنگام اجرای دستور

source: preserve specific environment variables
fa: حفظ متغیّرهای محیطی مشخّص شده

source: edit files instead of running a command
fa: ویرایش پرونده‌ها به‌جای اجرای دستور

source: run command as the specified group name or ID
fa: اجرای دستور به عنوان شناسه یا نام گروه مشخّص شده

source: set HOME variable to target user's home dir
fa: تنظیم متغیر HOME به شاخهٔ خانگی کاربر هدف

source: display help message and exit
fa: نمایش پیام راهنما و خروج

source: run command on host (if supported by plugin)
fa: اجرای دستور روی میزبان (در صورت پشتیبانی از سوی افزایه)

source: run login shell as the target user; a command may also be specified
fa: اجرای پوسته ورود به عنوان کاربر هدف. می‌توان دستوری نیز مشخّص کرد

source: remove timestamp file completely
fa: برداشتن کامل پروندهٔ مهر زمانی

source: invalidate timestamp file
fa: ابطال پروندهٔ مهر زمانی

source: list user's privileges or check a specific command; use twice for longer format
fa: سیاهه کردن اجازه‌های کاربر یا بررسی دستوری مشخّص. دوبار استفاده برای قالب طولانی‌تر

source: non-interactive mode, no prompts are used
fa: حالت غیرتعاملی. هیچ اعلانی استفاده نمی‌شود

source: preserve group vector instead of setting to target's
fa: استفاده از بردار گروه به جای تنظیم به بردارد هدف

source: use the specified password prompt
fa: استفاده از اعلان گذرواژهٔ مشخّص شده

source: change the root directory before running command
fa: تغییر شاخهٔ ریشه پیش از اجرای دستور

source: create SELinux security context with specified role
fa: ایجاد بافتار امنیتی SELinux با نقش مشخّص شده

source: read password from standard input
fa: خواندن گذرواژه از ورودی استاندارد

source: run shell as the target user; a command may also be specified
fa: اجرای پوسته به عنوان کاربر هدف. می‌توان دستوری نیز مشخّص کرد

source: create SELinux security context with specified type
fa: ایجاد بافتار امنیتی SELinux با گونهٔ مشخّص شده

source: terminate command after the specified time limit
fa: خاتمهٔ دستور پس از محدودیت زمانی مشخّص شده

source: in list mode, display privileges for user
fa: نمایش اجازه‌های کاربر در حالت سیاهه‌ای

source: run command (or edit file) as specified user name or ID
fa: اجرای دستور (یا ویرایش پرونده) به عنوان شناسه یا نام کاربر مشخّص شده

source: display version information and exit
fa: نمایش اطّلاعات نگارش و خروج

source: update user's timestamp without running a command
fa: به‌روز رسانی مهر زمانی بدون اجرای دستور

source: stop processing command line arguments
fa: توقّف پردازش آرگومان‌های خط فرمان

source: Only one of the -c or -i options may be specified
fa: فقط باید یکی از گزینه‌های ‪-c‬ یا ‪-i‬ مشخّص شود

source: invalid file descriptor number: %s
fa: شمارهٔ توصیف‌گر پرونده نامعتبر: %s

source: The -%c option may not be used in edit mode.
fa: گزینهٔ ‪-%c‬ نباید در حالت ویرایش استفاده شود.

source: The -%c option may only be used in edit mode.
fa: گزینهٔ ‪-%c‬ فقط باید در حالت ویرایش استفاده شود.

source: %s: editing symbolic links is not permitted
fa: %s: ویرایش پیوندهای نمادین مجاز نیست

source: %s: editing files in a writable directory is not permitted
fa: %s: ویرایش پرونده‌ها در یک شاخهٔ قابل نوشتن مجاز نیست

source: unable to get group list
fa: ناتوان در دریافت فهرست گروه

source: unable to save handler for signal %d
fa: ناتوان در ذخیرهٔ مدیریت کننده برای علامت %Id

source: unable to restore handler for signal %d
fa: ناتوان در بازگردانی مدیریت کننده برای علامت %Id

source: user "%s" is not a member of project "%s"
fa: کاربر «%s» عضوی از پروژهٔ «%s» نیست

source: Sudo version %s
fa: نگارش Sudo‏ %s

source: Configure options: %s
fa: گزینه‌های پیکربندی: %s

source: fatal error, unable to load plugins
fa: خطای مرگبار، بار کردن افزایه‌ها ممکن نیست

source: plugin did not return a command to execute
fa: افزایه دستوری برای اجرا برنگرداند

source: you do not exist in the %s database
fa: در پایگاه دادهٔ %s وجود ندارید

source: %s must be owned by uid %d and have the setuid bit set
fa: مالک %s باید شناسهٔ کاربری %Id بوده و بیت setuid نیز تنظیم شده باشد

source: effective uid is not %d, is %s on a file system with the 'nosuid' option set or an NFS file system without root privileges?
fa: شناسهٔ کاربری موثّر %Id نیست. آیا %s روی سامانه‌ای پرونده با گزینهٔ nosuid تنظیم شده یا سامانهٔ پروندهٔ NFSای بدون اجازه‌های ریشه است؟

source: effective uid is not %d, is sudo installed setuid root?
fa: شناسهٔ کاربری موثّر %Id نیست. سودو ریشهٔ setuid را نصب کرده؟

source: unexpected child termination condition: %d
fa: وضعیت خاتمهٔ فرزند غیرمنتظره: %Id

source: no writable temporary directory found
fa: هیچ شاخهٔ موقّتی قابل نوشتنی یافت نشد

source: %s left unmodified
fa: %s بدون تغییر باقی‌ماند

source: %s unchanged
fa: %s تغییر نکرد

source: sesh: unknown error %d
fa: sesh: خطای ناشناختهٔ %Id

source: unable to copy temporary files back to their original location
fa: ناتوان در رونویسی پرونده‌های موقّتی به مکان اصلی‌شان

source: unable to copy some of the temporary files back to their original location
fa: ناتوان در رونویسی بعضی از پرونده‌های موقّتی به مکان اصلی‌شان

source: unable to change uid to root (%u)
fa: ناتوان در تنظیم uid به روت (%u)

source: unable to read the clock
fa: ناتوان در خواندن ساعت

source: timed out reading password
fa: زمان خواندن گذرواژه تمام شده است

source: no password was provided
fa: هیچ گذرواژه‌ای ارائه نشده است

source: unable to read password
fa: ناتوان در خواندن گذرواژه

source: unable to set gid to %u
fa: ناتوان در تنظیم gid به %u

source: unable to set uid to %u
fa: ناتوان در تنظیم uid به %u

source: unable to run %s
fa: ناتوان در اجرای %s
